;本文件是 GreenChrome 的配置文件，采用INI格式
;以分号“;”开始的行只有注释作用，整行内容将会被忽略


[界面增强]
;直接在标签上双击就可以关闭页面
双击关闭标签页=1

;开启此选项时，按住 SHIFT 再点击右键可以恢复打开菜单
右键关闭标签页=0

;鼠标悬停在标签上一定时间将会自动激活标签页
悬停激活标签页=0

;悬停多久后激活标签页，单位毫秒，不填为系统默认值
悬停时间=

;防止关闭最后的标签时关闭整个浏览器（通过新建一个标签）
;手动点击关闭按钮时无法阻止
;Chrome 87版本后功能失常
保留最后标签=0

;鼠标悬停在标签栏时，滚动滚轮可切换标签
悬停快速标签切换=1

;按住鼠标右键时，滚动滚轮可切换标签
;这个功能会影响扩展程序的鼠标手势（GreenChrome手势不受影响）
右键快速标签切换=1

;点击书签在新标签页中打开，不兼容有特殊功能的js书签
新标签打开书签=1

;地址栏输入的网址在新标签中打开（通过监控回车键）
新标签打开网址=0

;当前页面是新标签页时，上面两个选项（新标签页中打开书签、新标签页中打开网址）不生效
新标签页不生效=1

;新标签打开书签 的新标签页将会打开在前台
前台打开新标签=1

;尝试处理通过菜单打开书签，如有副作用请关闭
处理弹出菜单=1

;如果界面增强功能异常，显示缩放不是100%的用户，应该修改为系统DPI，不要百分号
DPI=100


[基本设置]
;按下老板键后可隐藏所有Chrome窗口，再次按下即可恢复
老板键=Ctrl+Alt+B

;可以去除最常访问缩略图，并且保留主题效果
空白新标签页面=0

;离线包不带更新程序，点开Chrome关于时会有更新出错提示，此选项可关闭出错提示
移除更新错误=1

;如果使用开发者模式加载扩展程序，打开chrome的时候会有警告，此选项可以关闭警告
移除开发者模式警告=0

;在Chrome关闭时自动结束启动时运行的程序
自动结束运行程序=1

;可以打造绿色版Chrome，防止更换电脑、重装系统时个人设置丢失
;警告：一旦用户数据已经生成，修改此选项会导致个人设置被重置
便携化=1

;停用后将不能使用WEB设置界面
;可能会造成浏览器卡死，所以停用
停用WEB设置=1


[追加参数]
;这里定义的Chrome命令行参数，可在Chrome启动时自动插入
;更多命令可百度搜索 https://www.baidu.com/s?wd=chrome%E5%91%BD%E4%BB%A4%E8%A1%8C%E5%8F%82%E6%95%B0

;自定义用户数据目录到当前目录下，如果是安装版用户，清空此选项，并且取消便携化即可使用原有数据
--user-data-dir=%app%\User Data


[启动时运行]
;这里的程序会随Chrome一起启动，如果路径（包括变量展开后）包含空格，需要用双引号括起来


[关闭时运行]
;这里的程序会在Chrome关闭时启动（隐藏执行），用于执行一些清理工作，例如运行taskkill命令结束进程


[按键转换]
;启用后才会转换按键
启用=0

;按下按键不放开，是否重复识别
识别重复=1

;即使光标在编辑框中依然转换按键
忽略编辑框=1


[按键转换列表]
;定义F3=Ctrl+Tab即可在按下F3时变为Ctrl+Tab
F1=Ctrl+T
F2=Ctrl+Shift+Tab
F3=Ctrl+Tab
F4=Ctrl+W


[鼠标手势]
;关闭后才能使用扩展程序的鼠标手势（还要关闭右键快速标签切换）
启用=1

#颜色格式为ARGB 16进制，默认值:C8337AB7
手势颜色=C8337AB7

;是否显示识别结果
显示操作=1

;是否显示手势轨迹
显示轨迹=1

;手势轨迹是否绘制箭头
轨迹箭头=1

#不要设置得太粗，默认值:3
轨迹粗细=3

;启用时遇到无法识别的手势将会添加为新手势
训练模式=0

;灵敏度调整，较低时成功率、错误率高，较高时正确率、失败率高，默认：50
灵敏度=50

;用于同步手势，详情请前往耍下交流群
同步密钥=

[手势操作]
;因为配置文件无法直观展现手势的形状，推荐使用WEB设置页面进行修改
;设置页面：https://static.pzhacm.org/shuax/cfg/gc/#gesture-action
;配置格式：手势=名称|动作|参数

;简单方向
E0030C7C=页面顶部|SendKeys|Home
98D9C89F=页面底部|SendKeys|End
4E7908C1=后退|SendKeys|Back
C3C6D1DD=前进|SendKeys|Forward
DAF33497=刷新|SendKeys|Ctrl+R
BE7A7DE9=强制刷新|SendKeys|Ctrl+Shift+R
8474E9FD=关闭标签|SendKeys|Ctrl+W
1D3B0407=撤销关闭|SendKeys|Ctrl+Shift+T
D0FACB21=上翻页|SendKeys|PageUp
6BA7B590=下翻页|SendKeys|PageDown
B42D27CD=切换到右侧标签|SendKeys|Ctrl+Tab
EFAD9D5A=切换到左侧标签|SendKeys|Ctrl+Shift+Tab

;图形手势
0778B169=计算器|RunApp|Calc.exe
A378410B=设置GreenChrome|OpenUrl|https://tkyu.github.io/shuaxconfigs/gc/
CEBE4F28=最小化|Window|0
B4EEC40B=最大化/还原|Window|1
27A89661=置顶/取消置顶|Window|2
3BCD26A9=打开新窗口|SendKeys|Ctrl+N
925B78BE=打开隐身窗口|SendKeys|Ctrl+Shift+N
17181CBB=关闭所有标签页|SendKeys|Ctrl+Shift+W
AFAFFC9C=打开主页|SendKeys|Alt+Home
BA1B317B=开发者工具|SendKeys|F12


[手势数据]
;用于识别手势形状，由程序自动生成，不建议手动修改
;简单方向
725,671|725,659|725,649|725,636|725,615|725,581|725,552|725,518|725,508|726,475|727,446|727,425|728,412|
746,487|746,500|746,513|746,531|746,543|746,553|746,563|746,576|746,586|
2613,498|2600,498|2590,498|2576,499|2472,499|2462,499|2436,499|2405,499|2389,499|2374,499|
2366,550|2377,550|2392,550|2412,551|2445,552|2598,549|2624,549|
1127,561|1137,590|1142,606|1148,628|1157,653|1164,678|1167,695|1173,715|1179,729|1181,743|1181,755|1184,764|1187,780|1188,790|1191,804|1192,811|1193,818|1194,822|1194,825|1194,827|1194,822|1194,815|1194,806|1194,796|1194,784|1194,772|1194,758|1194,743|1194,725|1194,704|1194,679|1194,655|1194,630|1194,609|1194,594|1194,577|1194,567|1197,556|1198,547|1199,540|1199,534|
1407,791|1409,771|1409,761|1409,746|1409,730|1409,712|1409,688|1411,666|1411,642|1412,623|1416,599|1418,565|1422,539|1424,530|1425,518|1425,511|1426,505|1428,500|1428,498|1428,497|1428,500|1428,511|1428,519|1428,533|1428,551|1430,569|1434,621|1439,645|1442,671|1447,695|1449,709|1450,723|1454,744|1454,749|1455,753|1456,757|1456,758|1456,760|1458,771|1458,773|1458,777|1458,780|1458,782|1458,784|1458,785|1458,787|1459,788|1459,789|1459,790|1459,792|1459,793|1459,794|1459,796|
1495,518|1495,549|1495,563|1495,578|1498,594|1501,606|1504,618|1508,631|1508,641|1509,648|1509,655|1510,661|1510,668|1510,673|1510,678|1510,683|1510,689|1510,693|1510,696|1510,698|1510,700|1511,701|1511,704|1511,705|1511,708|1511,710|1511,712|1511,714|1511,715|1511,716|1511,719|1514,719|1529,719|1555,719|1570,719|1585,719|1601,719|1636,719|1669,724|1688,726|1694,726|1697,726|1699,726|1702,726|1705,726|1707,726|1709,726|1711,726|1712,726|1714,726|1715,726|1717,726|1721,726|1724,726|
1723,604|1723,619|1723,624|1723,633|1723,641|1723,653|1723,665|1723,680|1725,694|1725,709|1725,725|1725,738|1725,752|1725,766|1725,776|1727,785|1729,797|1730,804|1731,810|1731,815|1732,818|1732,819|1732,822|1732,823|1732,824|1728,824|1721,824|1709,824|1697,824|1687,824|1675,824|1663,824|1651,824|1641,824|1630,824|1622,824|1613,824|1606,824|1602,825|1600,825|1597,825|1596,825|1595,825|1594,825|1588,825|1582,825|1578,825|1577,825|1576,825|1575,825|1574,825|1571,825|1569,825|1567,825|1566,825|1565,825|1564,825|1559,825|1557,825|1550,825|1536,825|1531,825|1527,825|1523,825|1521,826|
1461,881|1486,881|1497,881|1510,881|1526,881|1542,881|1559,881|1578,882|1595,884|1610,884|1622,884|1633,884|1641,884|1645,884|1650,884|1656,886|1660,887|1665,888|1673,891|1676,891|1677,891|1677,889|1673,864|1666,835|1665,816|1665,796|1665,771|1665,750|1665,700|1660,678|1659,659|1654,645|1652,636|1648,624|1647,620|1647,616|1646,614|1646,613|1646,612|
1538,682|1559,681|1573,681|1588,681|1603,681|1622,681|1640,681|1657,681|1671,681|1679,681|1688,681|1691,681|1693,681|1694,681|1695,682|1695,690|1695,700|1695,712|1695,726|1695,741|1695,755|1695,770|1695,787|1695,804|1695,821|1695,834|1695,848|1695,857|1695,867|1695,872|1695,877|1695,879|
1440,777|1466,778|1475,782|1487,784|1503,788|1522,791|1541,792|1563,797|1586,800|1600,800|1611,800|1623,800|1634,800|1644,804|1656,806|1667,806|1676,807|1681,808|1688,808|1691,810|1692,810|1684,810|1662,810|1648,813|1636,813|1622,813|1608,817|1596,818|1570,821|1549,825|1530,826|1517,830|1507,831|1498,831|1488,832|1479,834|1472,836|1466,837|1462,837|1459,837|1458,837|1457,837|1456,837|1455,837|1453,837|1450,838|1449,838|1447,838|1445,838|1442,839|
1571,769|1541,773|1526,778|1510,780|1497,782|1479,785|1466,786|1449,789|1433,792|1419,793|1404,794|1390,796|1379,801|1369,801|1360,803|1354,805|1349,805|1346,805|1344,805|1338,806|1335,806|1328,806|1323,806|1318,806|1314,807|1312,808|1311,808|1310,808|1312,808|1321,808|1336,808|1347,810|1359,810|1369,810|1383,810|1396,810|1408,812|1421,814|1431,814|1440,817|1452,820|1463,824|1477,828|1489,828|1501,831|1510,832|1518,832|1524,832|1526,832|1529,832|1530,832|1531,832|1532,832|1534,832|1538,834|1545,834|1551,836|1556,837|1560,838|1562,838|1563,838|1564,838|1566,839|1578,843|1587,845|1596,845|1598,845|1600,845|
;图形手势
;C
983,303|972,302|960,303|942,303|929,306|917,308|907,310|893,315|880,320|868,324|857,327|848,332|837,340|829,346|817,354|806,366|799,375|793,383|786,394|775,408|768,423|762,436|757,450|754,463|754,473|753,488|753,501|753,514|753,526|754,540|756,550|761,560|767,572|774,581|781,590|792,599|803,609|815,615|827,623|838,628|848,631|860,635|870,640|883,642|893,645|903,647|913,647|923,649|934,650|947,651|957,651|967,652|977,652|987,652|997,652|
;S
1031,326|1021,323|1011,320|1000,319|989,319|979,319|968,318|957,318|947,318|936,318|925,317|914,318|900,318|888,319|876,319|863,321|850,324|838,326|827,332|816,339|805,347|796,354|788,361|781,369|773,379|766,390|762,401|760,412|759,422|758,433|757,445|757,455|760,466|766,474|774,483|782,489|792,495|801,500|811,505|822,509|833,514|843,516|854,519|866,522|879,526|892,527|902,529|914,532|926,534|936,537|949,541|961,545|971,548|985,551|995,556|1008,561|1018,564|1027,569|1036,577|1044,585|1052,593|1058,603|1062,613|1066,624|1068,634|1068,644|1068,654|1066,665|1066,675|1065,686|1061,696|1055,704|1047,711|1039,721|1028,729|1017,736|1007,739|996,742|983,746|971,749|958,751|947,751|937,751|926,751|915,751|905,752|895,752|885,752|875,752|863,752|853,752|843,752|831,752|818,752|808,750|798,749|788,749|777,749|766,747|756,744|
;N
756,628|759,618|759,608|758,595|758,540|758,527|758,509|758,496|758,477|758,462|759,451|760,440|760,428|762,418|762,408|763,397|770,405|775,419|783,436|793,458|807,476|819,493|831,510|840,523|849,533|855,543|864,558|871,569|878,579|885,592|894,604|901,615|907,624|909,614|909,599|909,589|909,570|909,551|911,532|912,514|910,492|910,477|910,466|910,447|910,437|910,425|910,410|910,399|910,389|910,379|
;P
849,709|849,699|848,685|848,636|848,624|846,596|846,584|846,567|846,556|846,538|845,527|845,510|845,500|844,485|844,475|844,460|842,448|844,438|844,427|844,416|844,406|844,395|844,384|846,374|850,364|856,355|867,350|878,347|888,347|898,347|909,349|919,352|931,356|941,359|950,364|958,370|967,378|973,387|980,395|986,403|991,412|996,424|999,435|1000,447|1000,458|1000,468|998,478|996,489|993,499|986,508|980,516|971,522|962,528|953,533|943,537|933,538|923,539|913,540|902,541|892,541|881,540|870,540|860,539|850,539|
;O
877,333|866,332|855,332|845,333|835,335|818,343|806,351|796,356|787,363|779,373|770,383|763,391|757,399|750,410|745,420|740,431|736,442|733,452|730,464|729,475|729,485|729,498|729,509|729,520|730,532|732,542|736,553|743,563|749,573|756,581|764,588|772,595|780,603|789,608|797,614|806,619|814,625|823,631|835,635|845,637|855,638|867,639|878,640|889,640|900,640|911,640|921,639|931,639|943,638|954,636|964,632|974,629|987,624|996,618|1005,613|1013,606|1022,598|1029,589|1035,581|1041,573|1046,563|1050,552|1053,541|1055,530|1056,520|1056,508|1056,496|1056,486|1056,475|1056,465|1055,455|1052,444|1049,433|1044,423|1038,415|1032,406|1026,398|1020,390|1013,382|1007,374|999,366|991,359|982,354|973,349|963,344|952,341|941,339|931,336|921,336|911,334|901,333|891,332|
;M
687,621|689,608|693,593|707,556|717,532|724,518|729,507|750,463|756,451|761,439|771,420|777,404|783,392|788,383|793,372|800,361|806,351|813,342|821,352|824,362|830,374|836,388|842,401|846,412|854,429|860,441|864,451|870,461|873,471|877,483|881,495|885,506|889,516|894,527|899,538|901,548|901,537|904,526|907,515|911,504|915,492|918,481|924,467|929,455|936,439|942,428|947,416|952,404|957,392|962,381|967,372|973,362|980,354|986,346|991,358|992,368|997,381|1003,390|1009,403|1014,415|1020,431|1026,446|1030,457|1036,469|1039,479|1044,489|1050,503|1055,515|1060,527|1065,536|1069,548|1074,561|1078,572|1084,580|1087,590|1092,601|1096,611|1101,621|
;R
2410,705|2410,692|2410,679|2412,535|2412,503|2414,422|2414,412|2416,402|2420,392|2425,383|2433,376|2444,370|2458,366|2470,365|2483,365|2494,365|2506,367|2517,373|2524,381|2530,389|2536,398|2542,408|2548,418|2550,430|2549,440|2547,451|2546,461|2540,473|2533,482|2526,491|2518,499|2509,508|2499,516|2488,522|2478,527|2465,529|2454,531|2444,531|2434,530|2424,528|2414,528|2424,531|2434,535|2445,539|2455,545|2466,555|2476,564|2485,571|2494,581|2502,590|2511,602|2517,612|2523,622|2531,632|2539,640|2543,650|2551,660|2554,670|2557,680|2560,690|2563,700|2565,710|
;B
2411,690|2411,679|2411,669|2411,656|2412,604|2412,591|2412,570|2412,551|2412,540|2412,525|2412,511|2412,493|2412,482|2412,465|2410,451|2410,439|2411,427|2411,417|2411,407|2415,396|2424,388|2433,382|2443,378|2453,378|2465,378|2476,378|2487,378|2501,382|2511,386|2525,389|2535,394|2546,402|2556,411|2561,420|2562,430|2562,441|2560,451|2554,461|2548,472|2538,482|2530,489|2522,497|2511,503|2502,509|2492,514|2484,520|2473,523|2462,526|2450,528|2439,528|2429,528|2419,528|2429,529|2441,529|2452,529|2464,530|2478,532|2491,535|2501,537|2512,541|2522,547|2532,552|2542,562|2549,572|2555,580|2562,591|2567,600|2571,612|2573,623|2574,634|2572,646|2567,656|2561,665|2555,673|2547,680|2538,685|2526,688|2515,691|2505,691|2495,692|2484,692|2474,692|2463,692|2452,692|2441,692|2431,692|2421,692|
;H
2419,313|2418,323|2418,335|2418,358|2418,369|2418,379|2418,396|2418,408|2418,420|2418,432|2418,448|2418,460|2418,470|2418,481|2418,499|2418,511|2418,523|2419,549|2419,564|2419,574|2419,587|2419,605|2419,616|2418,628|2417,638|2417,651|2417,665|2418,682|2418,692|2419,702|2418,712|2416,701|2416,691|2416,680|2417,668|2417,657|2418,644|2419,632|2419,622|2420,612|2420,599|2420,589|2422,575|2427,565|2429,555|2434,543|2440,533|2447,523|2455,515|2463,509|2473,504|2482,498|2492,497|2502,497|2513,496|2524,496|2536,498|2547,502|2557,508|2565,514|2573,522|2581,530|2586,539|2593,548|2594,558|2596,568|2598,578|2598,588|2599,599|2599,612|2599,622|2598,633|2598,644|2598,654|2598,664|2598,675|2598,685|2597,695|2596,705|2596,715|
;W
2193,485|2198,495|2205,508|2211,519|2215,529|2221,538|2230,552|2235,561|2243,573|2252,586|2258,598|2263,607|2270,620|2276,628|2284,638|2289,647|2294,657|2299,666|2304,676|2314,669|2321,659|2327,649|2332,638|2338,628|2345,616|2351,606|2356,597|2361,588|2367,575|2373,566|2380,555|2385,546|2391,538|2396,547|2398,557|2404,569|2409,578|2416,589|2423,600|2428,610|2435,621|2444,632|2450,640|2456,651|2462,659|2468,668|2475,676|2481,686|2488,678|2492,668|2496,655|2501,642|2505,631|2509,615|2517,598|2521,587|2527,577|2532,567|2540,555|2548,545|2553,535|2560,525|2566,517|2571,505|2577,494|2582,484|


[hosts]
;启用后才会打开hosts功能
启用=0

;hosts文件保存位置
保存位置=%app%\gc-hosts.txt

;网友提供的hosts下载地址，hosts文件可以提供域名到IP的映射关系
下载地址=https://raw.githubusercontent.com/racaljk/hosts/master/hosts

;程序用于探测更新的数据，每天会更新hosts一次
更新检查=

[Hosts配置]
;直接定义host映射，这里定义的条目优先级会高于hosts节点离订阅的host，请注意在修改以后重启浏览器并前往 chrome://net-internals/#dns 清除dns缓存
;niubi.shuax.com=127.0.0.1

[检查更新]
;此处设置由 Google Chrome 更新器 自动生成，不建议手动修改
检查更新=1
检查版本=Stable
更新器地址=
